{
  "title": "The Thing in the Drain",
  "description": "A small town secret tied to a red balloon. When the drain calls, some answers are worse than silence. Red drops, drowned smiles and something patient behind pipes.",
  "pages": [
    {
      "id": 0,
      "text": "You find a red balloon snagged on the iron lip of a storm drain. It sways though the street is still. Beneath it runs a dark ribbon of water that smells faintly of pennies and old fruit. A child's voice hums just under hearing.",
      "image": "/sttorei/it/0.jpg",
      "options": [
        { "text": "Reach for the balloon", "next": 1 },
        { "text": "Walk away, fast", "next": 2 },
        { "text": "Call someone's name", "next": 3 }
      ]
    },
    {
      "id": 1,
      "text": "The balloon yields to your fingers and floats upward, but your hand brushes the drain. Cold water splashes, and on your palm land three tiny red drops that don't smear. A ripple in the drain answers and a bubble shapes itself into a face for a heartbeat.",
      "image": "/sttorei/it/1.jpg",
      "options": [
        { "text": "Peer into the drain", "next": 4 },
        { "text": "Blow the drops off your hand and run", "next": 2 }
      ]
    },
    {
      "id": 2,
      "text": "You jog away and the streetlights blink twice like slow heartbeats. When you glance back the balloon has not moved, but a shape is crouched at the drain's mouth—a patch of dark that looks almost like a smile.",
      "image": "/sttorei/it/2.jpg",
      "options": [
        { "text": "Confront the shape", "next": 4 },
        { "text": "Keep going home", "next": 15 }
      ]
    },
    {
      "id": 3,
      "text": "You call a name you used to say as a kid. The wind answers with a child's giggle. Something in the drain imitates the laughter in your throat and then copies it back slower and wrong, stretching the vowels until they hurt.",
      "image": "/sttorei/it/3.jpg",
      "options": [
        { "text": "Repeat the giggle back", "next": 4 },
        { "text": "Drop the balloon and step away", "next": 2 }
      ]
    },
    {
      "id": 4,
      "text": "The drain is deeper than it should be. The water reflects red like a warning. Far below, eyes blink and reflect your face as if in another pond. A hand of wet hair pulls at the lipid edge and the sound of distant carnival music floats up.",
      "image": "/sttorei/it/4.jpg",
      "options": [
        { "text": "Reach down for the hand", "next": 5 },
        { "text": "Kick at the drain cover and run", "next": 6 }
      ]
    },
    {
      "id": 5,
      "text": "Your fingers barely brush sopping hair. A small voice says, 'Don't forget me.' Pain like cold pins skitters up your arm and for a moment you see your reflection smiling without moving. Something attached itself to your wrist—slim, thirsty tendrils.",
      "image": "/sttorei/it/5.jpg",
      "options": [
        { "text": "Pull free and sprint", "next": 6 },
        { "text": "Let it pull you in", "next": 13 }
      ]
    },
    {
      "id": 6,
      "text": "You run through streets that feel longer than they should. Street signs point in wrong directions and a whisper follows naming the place where you left your childhood. At the corner a clown poster peels and your name is scrawled beneath it.",
      "image": "/sttorei/it/6.jpg",
      "options": [
        { "text": "Tear the poster", "next": 7 },
        { "text": "Keep moving until you reach light", "next": 15 }
      ]
    },
    {
      "id": 7,
      "text": "Behind the poster the wall is damp; droplets of red film bead and run like oil. A seam in the brick opens and reveals an iron ladder descending into a smell of soap and iron. Someone left tiny footprints on the steps—too small to belong to an adult.",
      "image": "/sttorei/it/7.jpg",
      "options": [
        { "text": "Descend the ladder", "next": 8 },
        { "text": "Block the seam and leave", "next": 15 }
      ]
    },
    {
      "id": 8,
      "text": "You descend into a concrete belly where pipes sing and balloons cluster in corners like trapped moons. The air tastes like pennies. An ornate booth sits abandoned with ticket stubs and a child's glove splayed open inside.",
      "image": "/sttorei/it/8.jpg",
      "options": [
        { "text": "Search the booth", "next": 9 },
        { "text": "Follow the sound of laughter", "next": 11 }
      ]
    },
    {
      "id": 9,
      "text": "Under the counter you find a Polaroid of children playing by a drain—one is missing a face because the film never developed right. On the back are scrawled words: 'We gave them names. They keep ours.' A wet smear crosses the corner of the photo.",
      "image": "/sttorei/it/9.jpg",
      "options": [
        { "text": "Take the photo and keep moving", "next": 11 },
        { "text": "Leave it and follow the laughter", "next": 11 }
      ]
    },
    {
      "id": 10,
      "text": "Somewhere below a bell rings three times. You round a corner and see a small basin where red drops drip into the water and ripple like falling coins. Something beneath the basin moves in time with each drop.",
      "image": "/sttorei/it/10.jpg",
      "options": [
        { "text": "Lean over the basin", "next": 12 },
        { "text": "Smash the basin and run", "next": 14 }
      ]
    },
    {
      "id": 11,
      "text": "The laughter leads you to a chamber like a forgotten fairground—riders frozen on a carousel, balloons tied to railings, and a stage with a low stool. On the stool sits a red clown nose, and when you touch it for the first time the lights blink and the whole place exhales.",
      "image": "/sttorei/it/11.jpg",
      "options": [
        { "text": "Put the nose on", "next": 13 },
        { "text": "Search the stage", "next": 12 }
      ]
    },
    {
      "id": 12,
      "text": "The basin's water spirals and the reflection shows a second you standing across from you—older, smiling, with wet hair. It mouths a word you can almost read: 'Stay.' Behind that echo a shadow slides forward and the lights fail.",
      "image": "/sttorei/it/12.jpg",
      "options": [
        { "text": "Grab the reflection's hand", "next": 13 },
        { "text": "Step away and run up the ladder", "next": 14 }
      ]
    },
    {
      "id": 13,
      "text": "Everything splits. You wake back at the drain with a wet handprint on your chest and a child's lullaby ringing in your head. You feel a small movement under your skin—like something easing into a place the world didn't intend. Your choices narrow and the drain calls with softer words.",
      "image": "/sttorei/it/13.jpg",
      "options": [
        { "text": "Give in to the voice", "next": 16 },
        { "text": "Fight back and flee", "next": 14 }
      ]
    },
    {
      "id": 14,
      "text": "You scramble upward and the ladder spits you out into rain. For a moment the town seems whole again, but every puddle you pass shows a child's face under the surface. At home the lights flicker and your reflection in the window smiles before your mouth moves.",
      "image": "/sttorei/it/14.jpg",
      "options": [
        { "text": "Try to sleep and hope it was a dream", "next": 15 },
        { "text": "Go back to the drain and end it", "next": 10 }
      ]
    },
    {
      "id": 15,
      "text": "Days pass with quiet dread. Balloons appear at the edges of your life—tied to lampposts, clinging to the porch, tucked into mailboxes. People tell you it's coincidence but they don't know the sound the drain makes when it waits.",
      "image": "/sttorei/it/15.jpg",
      "options": [
        { "text": "Confront the drain once more", "next": 4 },
        { "text": "Leave town forever", "next": 18 }
      ]
    },
    {
      "id": 16,
      "text": "You stand and let the current take you. For a moment everything is warm and small voices chant names like a prayer. Then the world goes quiet and your sight narrows to a red circle. Your last memory is of a hand—no, of many hands—guiding you down among the pipes.",
      "image": "/sttorei/it/16.jpg",
      "options": []
    },
    {
      "id": 17,
      "text": "You wake up under pale light with a tiny wet pearl threaded on a string around your wrist. Children in the photographs now smile normally. The town appears safe; the drain hums under the street as if pleased.",
      "image": "/sttorei/it/17.jpg",
      "options": [{ "text": "RESTART", "next": 0 }]
    },
    {
      "id": 18,
      "text": "You leave town the next morning. You think distance will save you. Months later a package arrives—inside, a single red balloon and a Polaroid of you asleep. On the back, written in the child's scrawl: 'We come for what remembers.'",
      "image": "/sttorei/it/18.jpg",
      "options": [{ "text": "RESTART", "next": 0 }]
    }
  ]
}
